{"pageProps":{"htmlString":"<h1 id=\"the-first-project-of-my-mct-school-carreer\">The first project of my MCT school carreer</h1>\n<p>Every semester of the <a href=\"https://www.mct.be\">MCT course at Howest</a>, we have to create and realise a full stack project.\nIn the second semester of my first year, I had my first Project: <strong>AquaStats</strong>.</p>\n<p>The general idea of this project was that every student had to &#39;invent&#39; and create a device with 3 sensors and 1 actuator that are connected to the internet. We also had to show the data from the sensors on a self-made website.</p>\n<h1 id=\"what-was-my-project\">What was my project?</h1>\n<p>I created a device that was able to meassure chlorine, acidity and temperature from a typical Intex pool.\nThis data was periodically stored in a <strong>Mysql</strong> database and given to the frontend by a <strong>python</strong> backend.</p>\n<p>The frontend was made in typical <strong>HTML</strong>, <strong>CSS</strong> and <strong>JavaScript</strong>. This is because I did not know any frameworks yet. So oldschool it is! It was a pretty simple yet informational website.</p>\n<p>It could be used to read all historic data but alse manually start a reading of the poolwater.\nWhen manually starting a reading of the poolwater, you ofcourse want to see the data as soon as the reading has been done. This was done with the help of websockets.</p>\n<p>I used SocketIO in Python to setup a socket server where the webclient could subscribe to and listen to messages. As soon a message has been received, the data could be updated.</p>\n<p><img src=\"https://cdn.bandithemepark.net/DebaveyeElias/desktopAquaStats.png\" alt=\"Website AquaStats\" title=\"Website AquaStats\"></p>\n<h1 id=\"my-experience\">My experience</h1>\n<p>It definitely wasn&#39;t an easy task to start from scratch, but a lot of us made it through the first year with ease!</p>\n<p>With the support of all our teachers, and I think I can speak for a lot of people, did help a lot when something went wrong. If I may be honest, this project was the start of everything. Without the things I have learned at MCT, I think I wasn&#39;t able to make full stack applications like I do now (Hello this is future me 👋).</p>\n<p>A great start to a hopefully successful future.</p>\n","data":{"title":"MCT Project One","description":"My first IoT project in MCT at Howest Kortrijk. This was my first touches in the IT world.","coverImage":"https://cdn.bandithemepark.net/DebaveyeElias/MCTProjectOne.png","publishDate":"06-22-2020","tags":["HTML","CSS","Javascript","MYSQL","Python","Websockets","Raspberry Pi"]}},"__N_SSG":true}